// 霸都丶傲天 2019年10月10日 https://github.com/AJLoveChina/birthday
var config = {
    // 句子的长度可以任意， 你可以写十句话， 二十句话都可以
    // 每句话尽量不要超过15个字,不然展示效果可能不太好
    texts: [
        "送给大灰狼",      //这里,每句话结尾的最后一个逗号必须是英文的哦!! 很重要哦!!
        "今天是你的生日",
        "是我陪你过的第一个生日",
        "希望以后能多陪你过几个生日",
        "愿你身材越练越帅",
        "愿你一直健健康康",
        "愿你永远都有好运气",
        "愿你做过的美梦全部成真",
        "愿你接下来遇到志同道合的朋友",
        "愿你永远年轻",
        "永远热烈",
        "永远大笑",
        "永远勇敢",
        "永远与众不同",
        "愿你有自持而节制的华丽",
        "层出不穷的新鲜",
        "愈炼愈飞的魔性",
        "永远虔诚的天真",
        "愿你余生不将就",
        "往事不回头",
        "假如记忆有颜色",
        "愿你未来一年都是灿烂的盛夏",
        "如火如歌",
        "最后再说一遍",
        "（有点害羞）",
        "老公生日快乐！",
    ],
    /**
     * imgs 可以不填, 但是如果要填写的话必须遵循下面的格式
     * "对应上面的文字, 要完全一样" : "图片地址, 可以把图片放在imgs文件夹中"
     * 例如
     * "心爱的小可爱": "./imgs/xiaokeai.jpg"
     *
     * 如果不要图片的话, 直接在每行开头写两个斜杠注释即可, 例如下面的 "今天是你的生日" 的图片就不会展示了:)
     * Tip: 图片最好用正方形or接近正方形, 看起来效果更好
     */
    imgs: {
        "心爱的小可爱": "./imgs/xiaokeai.png",
        // "今天是你的生日": "./imgs/birthday.jpg",
    },
    // 按钮文字描述, 以下是默认的按钮文字，英文的，您可以改成你喜欢的文字
    desc: {
        turn_on: "开始",
        play: "音乐",
        bannar_coming: "颜色",
        balloons_flying: "好像少点东西",
        cake_fadein: "蛋糕？",
        light_candle: "蜡烛？",
        wish_message: "生日快乐",
        story: "A MESSAGE FOR YOU",
    }
};
